qmk/qmk_firmware/tmk_core/tool/mbed/mbed-sdk/libraries/mbed/targets/cmsis/TARGET_STM/TARGET_STM32L0/stm32l0xx_hal_flash_ex.c
  if(status == HAL_OK)
  {
    /* Clean the error context */
    ProcFlash.ErrorCode = HAL_FLASH_ERROR_NONE;

    if (OB_WRP & 0x0000FFFF)
    {
      if (NewState != OB_WRPSTATE_DISABLE)
      {
        WRP_Data = (uint16_t)(((OB_WRP & WRP_MASK_LOW) | OB->WRP01));
        OB->WRP01 = (uint32_t)(~(WRP_Data) << 16) | (WRP_Data);
      }             
      else
      {
        WRP_Data = (uint16_t)(~OB_WRP & (WRP_MASK_LOW & OB->WRP01));
        OB->WRP01 =  (uint32_t)((~WRP_Data) << 16) | (WRP_Data);
      }
    }
#if defined(STM32L071xx) || defined(STM32L072xx) || defined(STM32L073xx) || defined(STM32L081xx) || defined(STM32L082xx) || defined(STM32L083xx)  
    if (OB_WRP & 0xFFFF0000)
    {
      if (NewState != OB_WRPSTATE_DISABLE)
      {
        WRP_Data = (uint16_t)((((OB_WRP & WRP_MASK_HIGH) >> 16 | OB->WRP23))); 
        OB->WRP23 = (uint32_t)(~(WRP_Data) << 16) | (WRP_Data);
      }             
      else
      {
        WRP_Data = (uint16_t)((((~OB_WRP & WRP_MASK_HIGH) >> 16 & OB->WRP23))); 
        OB->WRP23 = (uint32_t)((~WRP_Data) << 16) | (WRP_Data);
      } 
    }

    OB_WRP = Sector2;
    if (OB_WRP & 0x0000FFFF)
    {
      if (NewState != OB_WRPSTATE_DISABLE)
      {
        WRP_Data = (uint16_t)(((OB_WRP & WRP_MASK_LOW) | OB->WRP45));
        OB->WRP45 =(uint32_t)(~(WRP_Data) << 16) | (WRP_Data);
      }             
      else
      {
        WRP_Data = (uint16_t)(~OB_WRP & (WRP_MASK_LOW & OB->WRP45));
        OB->WRP45 = (uint32_t)((~WRP_Data) << 16) | (WRP_Data);
      }
    }
#endif /* STM32L071xx || STM32L072xx || STM32L073xx || STM32L081xx || STM32L082xx || STM32L083xx */
  }
  /* Wait for last operation to be completed */
  status = FLASH_WaitForLastOperation(FLASH_TIMEOUT_VALUE);

  /* Return the write protection operation Status */
  return status;      
}

/**
  * @}
  */
#endif /* HAL_FLASH_MODULE_ENABLED */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
